Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The `outbound-global-bandwidth` and `inbound-global-bandwidth` parameters represent the maximum number of bytes per second for write and read operations, respectively. You shall also consider to have object size in read or write operations relatively adapted to the bandwidth you required. For instance having 10 MB objects for 10KB/s will lead to burst effect, while having 100 KB objects for 1 MB/s should be smoothly handle by the traffic shaping.
ja_jp: outbound-global-bandwidth` パラメータと `inbound-global-bandwidth` パラメータは、それぞれ書き込み操作と読み出し操作の 1 秒あたりの最大バイト数を表す。 また、読み取りまたは書き込み操作におけるオブジェクトのサイズを、必要な帯域幅に相対的に合わせることも考慮しなければならない。 例えば、10KB/秒に対して10MBのオブジェクトがあるとバースト効果が生じるが、1MB/秒に対して100KBのオブジェクトがあれば、トラフィック・シェーピングによってスムーズに処理できるはずである。

source: "Context" Holder
ja_jp: "コンテキスト" ホルダー

source: "Extension Codestarts" is the name we gave to our Quarkus extension quickstart code generation system. It aims to provide a personalized getting started experience with Quarkus. A Quarkus extension is able to provide one or more well defined codestarts which will contain the necessary resources and code required to start using that particular extension.
ja_jp: "Extension Codestarts" は、Quarkusのエクステンションクイックcodestart生成システムに与えられた名前です。このシステムは、Quarkusの使用開始時にパーソナライズされた体験を提供することを目的としています。Quarkusのエクステンションは、そのエクステンションを使い始めるために必要なリソースやコードを含む、1つまたは複数の明確に定義されたcodestartを提供することができます。

source: "Extension Codestarts" is the name we give to our Quarkus extension "getting started" code generation system. It aims to provide a personalized getting started experience with Quarkus. A Quarkus extension is able to provide one or more well-defined codestarts which will contain the resources and code required/recommended to start using that particular extension.
ja_jp: 「エクステンションコードスタート」は、Quarkusエクステンションの「スタート」コード生成システムの名称です。その目的は、Quarkusを使い始める際のパーソナライズされた体験を提供することです。Quarkusエクステンションには、1つ以上の明確に定義されたコードスタートがあり、そのコードスタートには、特定のエクステンションの使用を開始するために必要/推奨されるリソースやコードが含まれています。

source: "Extension Codestarts" is the name we give to our Quarkus extension quickstart code generation system. It aims to provide a personalized getting started experience with Quarkus. A Quarkus extension is able to provide one or more well-defined codestarts which will contain the resources and code required/recommended to start using that particular extension.
ja_jp: "エクステンション Codestart"は、Quarkusのエクステンションクイックスタートコード生成システムに付けられた名前です。このシステムは、Quarkus の使用開始時にパーソナライズされた体験を提供することを目的としています。 Quarkus のエクステンションは、そのエクステンションを使い始めるために必要な/推奨されるリソースやコードを含む、1つまたは複数の明確に定義された Codestart を提供することができます。

source: "Multitenancy is a software architecture where a single software instance can serve multiple, distinct user groups. Software-as-a-service (SaaS) offerings are an example of multitenant architecture." (link:https://www.redhat.com/en/topics/cloud-computing/what-is-multitenancy#:~:text=Multitenancy%20is%20a%20software%20architecture,an%20example%20of%20multitenant%20architecture.[Red Hat]).
ja_jp: マルチテナンシーとは、単一のソフトウェアインスタンスが複数の異なるユーザーグループにサービスを提供できるソフトウェアアーキテクチャーです。サービスとしてのソフトウェア (SaaS) これらはマルチテナントアーキテクチャーの一例です " (link:https://www.redhat.com/en/topics/cloud-computing/what-is-multitenancy#:~:text=Multitenancy%20is%20a%20software%20architecture,an%20example%20of%20multitenant%20architecture.[Red Hat])。

source: "The term multitenancy, in general, is applied to software development to indicate an architecture in which a single running instance of an application simultaneously serves multiple clients (tenants). This is highly common in SaaS solutions. Isolating information (data, customizations, etc.) pertaining to the various tenants is a particular challenge in these systems. This includes the data owned by each tenant stored in the database" (link:{hibernate-orm-docs-url}#multitenacy[Hibernate User Guide]).
ja_jp: 「マルチテナンシーという用語は、一般的にソフトウェア開発において、1 つの実行中のアプリケーションインスタンスが複数のクライアント (テナント) に同時にサービスを提供するアーキテクチャーを指します。これは SaaS ソリューションにおいて非常に一般的です。こうしたシステムでは、各テナントに関連する情報 (データ、カスタマイズなど) を分離することが特に課題となります。これには、データベースに保存される各テナントが所有するデータの分離も含まれます」 (link:{hibernate-orm-docs-url}#multitenacy[Hibernate ユーザーガイド])

source: "The term multitenancy, in general, is applied to software development to indicate an architecture in which a single running instance of an application simultaneously serves multiple clients (tenants). This is highly common in SaaS solutions. Isolating information (data, customizations, etc.) pertaining to the various tenants is a particular challenge in these systems. This includes the data owned by each tenant stored in the database" (link:{orm-doc-url-prefix}#multitenacy[Hibernate User Guide]).
ja_jp: 「一般的にマルチテナンシーとは、ソフトウェア開発において、1つのアプリケーションのインスタンスが複数のクライアント（テナント）に同時にサービスを提供するアーキテクチャを示す言葉です。SaaSソリューションでは非常に一般的なものです。このようなシステムでは各テナントに関わる情報（データ、カスタマイズなど）を分離することが特に重要な課題となります。これには、データベースに保存されている各テナントが所有するデータも含まれます」（ link:{orm-doc-url-prefix}#multitenacy[Hibernate User Guide]）。

source: ( see AutoScalingConfig )
ja_jp: (AutoScalingConfig を参照)

source: ( see GlobalAutoScalingConfig )
ja_jp: (GlobalAutoScalingConfig を参照)

source: ( see Probe )
ja_jp: (プローブを参照)

source: ( see Traffic )
ja_jp: (トラフィックを参照)

source: (1) can be achieved as follows:
ja_jp: (1)は以下のように実現できます:

source: (100) <<microprofile-config-properties-file,MicroProfile Config configuration file>> `META-INF/microprofile-config.properties` in classpath
ja_jp: (100) クラスパスの <<microprofile-config-properties-file,MicroProfile Config 設定ファイル>> `META-INF/microprofile-config.properties`

source: (100) xref:microprofile-config-properties-file[MicroProfile Config configuration file] `META-INF/microprofile-config.properties` in classpath
ja_jp: (100) クラスパスの xref:microprofile-config-properties-file[MicroProfile Config 設定ファイル] `META-INF/microprofile-config.properties`

source: (250) <<application-properties-file,Quarkus Application configuration file>> `application.properties` in classpath
ja_jp: (250) クラスパスの <<application-properties-file, Quarkus アプリケーション設定ファイル>> `application.properties`

source: (250) xref:application-properties-file[Quarkus Application configuration file] `application.properties` in classpath
ja_jp: (250) クラスパスの xref:application-properties-file[Quarkus Application の設定ファイル] `application.properties`

source: (260) <<application-properties-file,Quarkus Application configuration file>> in `$PWD/config/application.properties`
ja_jp: (260) `$PWD/config/application.properties` の <<application-properties-file, Quarkus アプリケーション設定ファイル>>

source: (260) xref:application-properties-file[Quarkus Application configuration file] in `$PWD/config/application.properties`
ja_jp: (260) `$PWD/config/application.properties` の xref:application-properties-file[Quarkus Applicationの設定ファイル]

source: (295) <<env-file,.env>> file in the current working directory
ja_jp: (295) 現在の作業ディレクトリーの <<env-file,.env>> ファイル

source: (295) xref:env-file[.env] file in the current working directory
ja_jp: (295) 現在の作業ディレクトリの xref:env-file[.env] ファイル

source: (300) <<environment-variables,Environment variables>>
ja_jp: (300) <<environment-variables,環境変数>>

source: (300) xref:environment-variables[Environment variables]
ja_jp: (300) xref:environment-variables[環境変数]

source: (400) <<system-properties,System properties>>
ja_jp: (400) <<system-properties,システムプロパティー>>

source: (400) xref:system-properties[System properties]
ja_jp: (400) xref:system-properties[システムプロパティ]

source: (Only for Oracle GraalVM CE/EE) Install the `native-image` tool using `gu install`:
ja_jp: (Oracle GraalVM CE/EE の場合のみ) `gu install` を使用して `native-image` ツールをインストールします。

source: (Optional) Add the GraalVM `bin` directory to the path
ja_jp: (オプション) GraalVM `bin` ディレクトリをパスに追加します

source: (Optional) Move the config using this convention: <<app-config>>.
ja_jp: (オプション) この規約でコンフィグを移動します: <<app-config>>

source: (Optional) Move the config using this convention: xref:app-config[application config application.yml].
ja_jp: (オプション) xref:app-config[アプリケーション設定 application.yml] 規約を用いて設定を移動します。

source: (Optional) Set the `JAVA_HOME` environment variable to the GraalVM installation directory.
ja_jp: (オプション) 環境変数 `JAVA_HOME` を GraalVM のインストールディレクトリに設定します。

source: (and similarly `maven.failsafe.plugin` when testing in native image).
ja_jp: (同様に、ネイティブイメージでテストする場合は `maven.failsafe.plugin`)。

source: (and similarly the Maven Failsafe plugin when testing in native image).
ja_jp: (ネイティブイメージでテストする場合は同様に Maven Failsafe プラグインを使用します)。

source: (optional) `nested-content` is a special key that will be replaced by the content of the tag.
ja_jp: (オプション) `nested-content` は、タグの内容に置き換えられる特別なキーです。

source: (optional) `podman-remote` installed for verification steps.
ja_jp: (オプション) 検証ステップのために `podman-remote` がインストールされていること

source: (optional?) `brew install llvm`
ja_jp: (任意?) `brew install llvm`

source: * Everything from GraalVM CE 21.3 * Additional monitor and thread events
ja_jp: * GraalVM CE 21.3 からのすべて * 追加のモニターとスレッドイベント

source: * Everything from GraalVM CE 22.3 * Additional monitor, thread, container, and allocation events * Stacktraces * Sampling based method profiling * Event streaming
ja_jp: * GraalVM CE 22.3 からのすべて * 追加のモニター、スレッド、コンテナー、割り当てイベント * スタックトレース * サンプリングベースのメソッドプロファイリング * イベントストリーミング

source: * Everything from GraalVM CE for JDK 17/20 and Mandrel 23.0 * Additional events * Always on allocation profiling (event throttling) * Partial support for old object sampling (no tracking paths to GC roots) * Support for `-XX:FlightRecorderOptions`
ja_jp: * JDK 17/20 および Mandrel 23.0 用の GraalVM CE のすべて * 追加イベント * 常時オンの割り当てプロファイリング (イベントスロットリング) * 古いオブジェクトサンプリングの部分的なサポート (GC ルートへのパスの追跡なし) * `-XX:FlightRecorderOptions` のサポート

source: * Minimal VM Level events * Custom events API * Start recordings upon executabe run or JFR Recording API
ja_jp: * 最小限の仮想マシンレベルイベント * カスタムイベント API * 実行可能ファイルまたは JFR Recording API の実行時に記録を開始する

source: * No old object sampling
ja_jp: * old オブジェクトのサンプリングはありません

source: * No old object sampling * No stacktrace tracing * No event streaming
ja_jp: * 古いオブジェクトのサンプリングなし * スタックトレースのトレースなし * イベントストリーミングなし

source: * Old object sampling is missing path to GC root support
ja_jp: * 古いオブジェクトサンプリングでは GC ルートサポートへのパスが欠落しています

source: * Start with a noun that names the concept or topic * Never start with an active verb, for example, an action word like configure, install, or start * Finish the implied sentence: "Understanding ..."
ja_jp: * コンセプトやトピックを表す名詞で始めます。 * たとえば、configure、install、start のような動作語です。 * 暗黙の文章を終わらせます。"Understanding..."

source: * Start with a noun that names the concept or topic * Never start with an active verb, for example, an action word like configure, install, or start * Finish the implied sentence: "Understanding … "
ja_jp: * コンセプトやトピックを表す名詞で始めます。 * 例えば、configure、install、startのような動作語です。 * 暗黙の文章を終わらせます："Understanding … "

source: * Start with an active verb in the imperative verb form, for example, "Create a ..." or "Secure a ..." * Be action-oriented or task-oriented, rather than feature-oriented * Finish the implied sentence: "How to ..."
ja_jp: * たとえば、「...を作成する」や「...を確保する」のように、命令形の能動態動詞から始めて下さい * 機能指向ではなく、アクション指向またはタスク指向として下さい * 暗黙の文章を終わらせてください："How to..."

source: * Start with an active verb in the imperative verb form, for example, "Create a ..." or "Secure a ..." * State what task the user will complete, with emphasis on the key topic or demonstrated activity * Be action-oriented or task-oriented, rather than feature-oriented * Be led by the needs of the user in learning mode. * Finish the implied sentence: "In this tutorial, you will ..."
ja_jp: * たとえば、'Create a ...' や 'Secure a ...' のように、命令形の能動態動詞で始めます。 * 重要なトピックや実演されたアクティビティに重点を置いて、ユーザーがどのようなタスクを完了するのかを述べてください。 * 機能指向ではなく、アクション指向またはタスク指向としてください。 * 学習モードにあるユーザーのニーズに沿ってください。 * 暗黙の文章を終わらせてください：「In this tutorial, you will ... "

source: * Start with an active verb in the imperative verb form, for example, ‘Create a ...’ or ‘Secure a ...’ * Be action-oriented or task-oriented, rather than feature-oriented * Finish the implied sentence: "How to.."
ja_jp: * 例えば、「...を作成する」や「...を確保する」のように、命令形の能動態動詞から始めて下さい * 機能指向ではなく、アクション指向またはタスク指向として下さい * 暗黙の文章を終わらせて下さい："どのように..."

source: * Start with an active verb in the imperative verb form, for example, ‘Create a ...’ or ‘Secure a ...’ * State what task the user will complete, with emphasis on the key topic or demonstrated activity * Be action-oriented or task-oriented, rather than feature-oriented * Be led by the needs of the user in learning mode. * Finish the implied sentence: "In this tutorial, you will… "
ja_jp: * 例えば、'Create a ...' や 'Secure a ...' のように、命令形の能動態動詞で始めます。 * 重要なトピックや実演されたアクティビティに重点を置いて、ユーザーがどのようなタスクを完了するのかを述べてください。 * 機能指向ではなく、アクション指向またはタスク指向として下さい * 学習モードにあるユーザーのニーズに沿ってください。 * 暗黙の文章を終わらせてください：「このチュートリアルでは... "

source: * Use a noun phrase to concisely summarize the content of the document * Not include the word 'reference' * Finish the implied sentence: "About ..."
ja_jp: * 文書の内容を簡潔に要約する名詞句の使用 * 「参照」という単語を含めない * 暗黙の文章を終える「について...」

source: **1. Memory Usage Metrics (Every allocator)**
ja_jp: **1. メモリ使用量メトリクス (すべてのアロケーター)**

source: **2. Pooled Allocator - Pinned Memory Metrics**
ja_jp: **2. プール型アロケーター - 固定メモリメトリクス**

source: **3. Pooled Allocator - Arena Metrics**
ja_jp: **3. プール型アロケーター - アリーナメトリクス**

source: **4. Cache Size Metrics**
ja_jp: **4. キャッシュサイズメトリクス**

source: **5. Thread-Local Cache Metrics**
ja_jp: **5. スレッドローカルキャッシュメトリクス**

source: **57 MB**! So, it uses ~2.7 times more RSS than the uncompressed executable. This overhead is because the compressed executable must unpack the program on startup and store it in memory. It can also increase the startup time, but this startup overhead is insignificant most of the time.
ja_jp: **57MB**! つまり、圧縮されていない実行可能ファイルに比べて2.7倍ものRSSを使用していることになります。このオーバーヘッドは、圧縮された実行可能ファイルが起動時にプログラムを解凍してメモリに格納しなければならないためです。また、起動時間が長くなることもありますが、この起動時のオーバーヘッドはほとんどの場合、重要ではありません。

source: **6. Chunk Size Metrics**
ja_jp: **6. チャンクサイズメトリクス**

source: **Accept transient failures:** Accept transient failures during the switchover period
ja_jp: *一時的な障害の許容:* 切り替え期間中の一時的な障害を許容する

source: **Access policy**: Open to users with a valid bearer token and the `user` role.
ja_jp: **アクセスポリシー**: 有効なベアラートークンと `user` ロールを持つユーザーに適用されます。

source: **AgentEmitter API**: The `AgentExecutor` methods now use `AgentEmitter` instead of the previous `EventQueue` + `TaskUpdater` combination, providing a more streamlined and intuitive API. This enhancement allows sending Messages for simple Agent interactions directly through the `AgentEmitter`, eliminating the need to interact with the EventQueue directly.
ja_jp: **AgentEmitter API**: `AgentExecutor` メソッドは、従来の `EventQueue` と `TaskUpdater` の組み合わせの代わりに `AgentEmitter` を使用するようになり、より合理化され直感的な API が提供されます。この機能強化により、単純なエージェント間のやり取りのためのメッセージを `AgentEmitter` 経由で直接送信できるようになり、EventQueue を直接操作する必要がなくなりました。

source: **All signals are enabled by default.**
ja_jp: **すべてのシグナルがデフォルトで有効になります。**

source: **Alternatively**, you can simply create the file https://maven.apache.org/configure.html#mvn-jvm-config-file[`.mvn/jvm.config`] at the root of your project: and any options you put in that file will be picked up by Maven, without having to set `MAVEN_OPTS`.
ja_jp: *または* 、プロジェクトのルートにファイル link:https://maven.apache.org/configure.html#mvn-jvm-config-file[`.mvn/jvm.config`] を作成すれば、 `MAVEN_OPTS` を設定しなくても、そのファイルに記述したオプションが Maven に取り込まれます。

source: **Arenas**: Large memory blocks that manage allocations.
ja_jp: **アリーナ**: 割り当てを管理する大きなメモリブロック。

source: **Authentication Challenge:** If the request is unauthenticated, mechanisms with a higher priority are asked to issue a challenge first.
ja_jp: **認証チャレンジ:** リクエストが認証されていない場合、優先度の高いメカニズムが最初にチャレンジを発行するように求められます。

source: **But it is also a very powerful tool to customize the build of your applications.**
ja_jp: **しかし、アプリケーションのビルドをカスタマイズするための非常に強力なツールでもあるのです。**

source: **CA-signed certificate**: CA, a trusted entity, signs the certificate. Clients trust this certificate by default, and it is the standard choice for production environments.
ja_jp: **CA 署名証明書**: 信頼されたエンティティーである CA が証明書に署名します。クライアントはデフォルトでこの証明書を信頼し、実稼働環境では標準的な選択肢となります。

source: **CA-signed certificate**: The certificate is signed by a Certificate CA, a trusted entity. This certificate is trusted by default and is the standard choice for production environments.
ja_jp: **CA 署名証明書**: 証明書は、信頼済みエンティティーである証明書 CA によって署名されます。 この証明書はデフォルトで信頼されており、実稼働環境での標準的な選択肢です。

source: **Card**: Add links to pages directly on the extension card.
ja_jp: **カード**: エクステンションカードに直接ページへのリンクを追加します。

source: **Centralized Management**: Delegate authorization decisions to Keycloak for consistent security policies across applications.
ja_jp: **集中管理**: アプリケーション間で一貫したセキュリティーポリシーを実現するために、認可の決定を Keycloak に委譲します。

source: **Chunks**: Memory segments within arenas (typically 16MB in size).
ja_jp: **チャンク**: アリーナ内のメモリセグメント (通常サイズは16MB)。

source: **Client references**: Identifying the client application acting on behalf of the user, per OAuth 2.0 Authorization Server standards.
ja_jp: **クライアント参照**: OAuth 2.0 Authorization Server 標準に従って、ユーザーに代わって動作するクライアントアプリケーションを識別します。

source: **Consuming existing v2 messages:** Configure the `Legacy8ByteIdHandler` for channels that need to read v2-produced messages:
ja_jp: *既存の v2 メッセージの消費:* v2 で生成されたメッセージを読み取る必要があるチャネルには、 `Legacy8ByteIdHandler` を設定します。

source: **Credential Verification:** Mechanisms with a higher priority are asked to verify credentials first. The first one to validate credentials wins.
ja_jp: **クレデンシャル検証:** 優先度の高いメカニズムが最初にクレデンシャルを検証するように求められます。最初にクレデンシャルを検証したものが優先されます。

source: **Cumulative acknowledgement**, configured using `ack-strategy=cumulative`, the consumer only acknowledges the last message it received. All messages in the stream up to (and including) the provided message are not redelivered to that consumer.
ja_jp: **累積確認応答** は、 `ack-strategy=cumulative` を使用して設定されるストラテジーです。コンシューマーが受信した最後のメッセージのみを確認します。 提供されたメッセージまでのストリーム内の全メッセージは、そのコンシューマーに再配信されません。

source: **Custom gauges and counters** for catalog-specific metrics like table count, namespace count, and metadata operation latency
ja_jp: カタログ固有のメトリクス（テーブル数、ネームスペース数、メタデータ操作のレイテンシーなど）に対応する**カスタムゲージとカウンター**

source: **Direct Memory**
ja_jp: **ダイレクトメモリ**

source: **Distributed traces** that follow requests across catalog operations, from initial metadata request through to storage access
ja_jp: 最初のメタデータリクエストからストレージアクセスまで、カタログ操作全体でリクエストを追跡する**分散トレース**

source: **During startup**, the application registers itself automatically using the detected or configured IP address and port.
ja_jp: **起動時**、アプリケーションは検出または設定された IP アドレスとポートを使用して自動的に登録されます。

source: **Dynamic Permissions**: Define access control dynamically by using resource attributes.
ja_jp: **動的権限**: リソース属性を使用してアクセス制御を動的に定義します。

source: **Efficient Resource Use**: Minimal CPU and memory consumption directly lowers operational cloud costs and provides sustainability benefits by reducing resource consumption.
ja_jp: **効率的なリソース使用**: 最小限の CPU とメモリ消費により、運用上のクラウドコストが直接削減され、リソース消費を抑えることで持続可能性のメリットが得られます。

source: **Endpoint path configuration defaults are now relative values.** `/q` is now `q`, `/metrics` is now `metrics`, etc. This means that, out of the box, these endpoints will resolve relative to the containing root, which is what JAX-RS does per spec, and is what we believe most users intuitively expect.
ja_jp: **エンドポイントのパス設定のデフォルト値が相対値になりました。** `/q` は `q` に、 `/metrics` は `metrics` になりました。これは、設定変更なしで、これらのエンドポイントが含まれているルートに対して相対的に解決されることを意味します。これは、JAX-RSが仕様ごとに行うことであり、ほとんどのユーザーが直感的に期待していることです。

source: **Event Processing**: Implemented the MainEventBus architecture for more robust event queue processing
ja_jp: **イベント処理**: より堅牢なイベントキュー処理を実現するために、 MainEventBus アーキテクチャーを実装しました。

source: **Event-Driven** - Mutiny places events at the core of its design. With Mutiny, you observe events, react to them, and create elegant and readable processing pipelines. A Ph.D. in functional programming is not required.
ja_jp: **イベントドリブン** - Mutinyはイベントを設計の中核に据えています。Mutinyでは、イベントを観測し、それに反応し、エレガントで読みやすい処理パイプラインを作成します。関数型プログラミングの博士号は必要ありません。

source: **Extra codestarts (as much as wanted, added on top of the base ones):**
ja_jp: **追加の Codestart (必要に応じて、基本コードの上に追加):**

source: **Extra codestarts (as much as wanted, to put on top):**
ja_jp: **追加のcodestart（好きなだけ、上乗せできます）: **

source: **Fast Startup Times:** By performing application initialization work at build time, Quarkus enables Polaris to start rapidly, critical for auto-scaling scenarios where catalog instances must spin up quickly to handle bursts of metadata requests from Spark, Trino, Flink, or other query engines. To give some numbers, canonical Quarkus applications start in 10ms in native mode, in ~100ms using AOT (Leyden), and in 1 to 3s in plain JVM mode.
ja_jp: **高速起動時間:** アプリケーションの初期化処理をビルド時に実行することで、Quarkus は Polaris を迅速に起動させることができます。これは、Spark、Trino、Flink、またはその他のクエリエンジンからのメタデータ要求のバーストを処理するために、カタログインスタンスが迅速に起動する必要があるオートスケーリングシナリオにとって非常に重要です。数値で示すと、標準的な Quarkus アプリケーションは、ネイティブモードで 10ms、AOT (Leyden) を使用すると約 100ms、プレーンな JVM モードでは 1〜3 秒で起動します。

source: **Faster Horizontal Scaling**: When deploying additional catalog instances to handle traffic spikes, containers start in milliseconds rather than seconds.
ja_jp: **より迅速な水平スケーリング**: トラフィックスパイクを処理するために追加のカタログインスタンスをデプロイする場合、コンテナーは秒単位ではなくミリ秒単位で起動します。

source: **Footer**: Add tabs to the footer for logs or other runtime information.
ja_jp: **フッター**: ログやその他のランタイム情報用のタブをフッターに追加します。

source: **Future-Proof Security:** Looking beyond today's standards, the project is investigating quantum-safe TLS and encryption. By integrating modern cryptographic practices, Polaris aims to provide a catalog that is secure not just for the present, but against the computational challenges of the future.
ja_jp: **将来性のあるセキュリティ:** 今日の標準を超えて、プロジェクトは量子安全なTLSと暗号化を調査しています。最新の暗号化プラクティスを統合することで、Polarisは現在だけでなく、将来の計算上の課題に対しても安全なカタログを提供することを目指します。

source: **GraphQL** was originally developed by **Facebook** in 2012 and has been an open standard since 2015.
ja_jp: **GraphQL** はもともと2012年に **Facebook** が開発したもので、2015年からはオープンスタンダードとなっています。

source: **HTTP metrics** for all Iceberg REST API requests, tagged by realm, operation, and status code
ja_jp: **HTTP メトリクス**: すべての Iceberg REST API リクエストについて、レルム、操作、ステータスコード別にタグ付けされます。

source: **HTTP+JSON/REST Transport**: Replaced `quarkus-rest-jackson` with `quarkus-rest` for better integration
ja_jp: **HTTP+JSON/REST トランスポート**: 統合を改善するために、 `quarkus-rest-jackson` を `quarkus-rest` に置き換えました。

source: **Heap Memory**
ja_jp: **ヒープメモリ**

source: **High Throughput**: The reactive, non-blocking engine based on Netty and Eclipse Vert.x enables Polaris to efficiently process numerous concurrent catalog operations, minimizing blocking during I/O to metadata stores or object storage. This non-blocking, reactive architecture allows Polaris to handle thousands of concurrent client connections, such as metadata requests from Spark or Trino, without dedicating a thread per request, thus avoiding thread-contention bottlenecks.
ja_jp: **高スループット**: Netty と Eclipse Vert.x に基づくリアクティブな非ブロッキングエンジンにより、Polaris は多数の同時カタログ操作を効率的に処理し、メタデータストアやオブジェクトストレージへの I/O 中のブロッキングを最小限に抑えます。この非ブロッキングなリアクティブアーキテクチャにより、Polaris は Spark や Trino からのメタデータリクエストなど、数千の同時クライアント接続を、リクエストごとにスレッドを割り当てることなく処理できるため、スレッド競合のボトルネックを回避できます。

source: **Higher Density**: Lower memory footprint allows more Polaris instances per node, reducing infrastructure costs.
ja_jp: **高密度化**: メモリフットプリントが小さいため、ノードあたりの Polaris インスタンス数が増え、インフラストラクチャコストが削減されます。
